Repository: hdkhosravian/cedrina
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, es, fa

# health_status_ok
source: System is operational
ar: النظام يعمل
es: El sistema está operativo
fa: سیستم در حال کار است

# invalid_token_subject
source: Invalid token: Subject missing
ar: رمز غير صالح: الموضوع مفقود
es: Token inválido: Falta el sujeto
fa: توکن نامعتبر: موضوع وجود ندارد

source: User not found or inactive
ar: المستخدم غير موجود أو غير نشط
es: Usuario no encontrado o inactivo
fa: کاربر یافت نشد یا غیرفعال است

# admin_privileges_required
source: The user does not have administrative privileges.
ar: المستخدم ليس لديه صلاحيات إدارية.
es: El usuario no tiene privilegios administrativos.
fa: کاربر دارای دسترسی‌های مدیریتی نیست.

# user_has_no_role
source: User has no assigned role, access denied.
ar: المستخدم ليس لديه دور محدد، تم رفض الوصول.
es: El usuario no tiene un rol asignado, acceso denegado.
fa: کاربر هیچ نقشی ندارد، دسترسی رد شد.

# permission_denied_for_action
source: User with role '{role}' does not have permission to {action} {resource}
ar: المستخدم ذو الدور '{role}' ليس لديه إذن لـ {action} {resource}
es: El usuario con rol '{role}' no tiene permiso para {action} {resource}
fa: کاربر با نقش '{role}' اجازه {action} {resource} را ندارد

# invalid_username_characters
source: Username must contain only letters, numbers, underscores, or hyphens
ar: يجب أن يحتوي اسم المستخدم على أحرف وأرقام وشرطات سفلية أو شرطات فقط
es: El nombre de usuario solo debe contener letras, números, guiones bajos o guiones
fa: نام کاربری باید فقط شامل حروف، اعداد، زیرخط یا خط تیره باشد

source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة
es: Nombre de usuario o contraseña inválidos
fa: نام کاربری یا رمز عبور نامعتبر است

# user_account_inactive
source: User account is inactive
ar: حساب المستخدم غير نشط
es: La cuenta de usuario está inactiva
fa: حساب کاربری غیرفعال است

source: Username already registered
ar: اسم المستخدم مسجل بالفعل
es: El nombre de usuario ya está registrado
fa: نام کاربری قبلاً ثبت شده است

source: Email already registered
ar: البريد الإلكتروني مسجل بالفعل
es: El correo electrónico ya está registrado
fa: ایمیل قبلاً ثبت شده است

# password_too_short
source: Password must be at least {length} characters long
ar: يجب أن تكون كلمة المرور {length} حرفًا على الأقل
es: La contraseña debe tener al menos {length} caracteres
fa: رمز عبور باید حداقل {length} کاراکتر باشد

# password_no_uppercase
source: Password must contain at least one uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل
es: La contraseña debe contener al menos una letra mayúscula
fa: رمز عبور باید حداقل یک حرف بزرگ داشته باشد

# password_no_lowercase
source: Password must contain at least one lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل
es: La contraseña debe contener al menos una letra minúscula
fa: رمز عبور باید حداقل یک حرف کوچک داشته باشد

# password_no_digit
source: Password must contain at least one digit
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل
es: La contraseña debe contener al menos un dígito
fa: رمز عبور باید حداقل یک عدد داشته باشد

# password_no_special_char
source: Password must contain at least one special character
ar: يجب أن تحتوي كلمة المرور على حرف خاص واحد على الأقل
es: La contraseña debe contener al menos un carácter especial
fa: رمز عبور باید حداقل یک کاراکتر ویژه داشته باشد

# token_expired
source: Token has expired
ar: انتهت صلاحية الرمز
es: El token ha expirado
fa: توکن منقضی شده است

source: Invalid OAuth user info
ar: معلومات مستخدم OAuth غير صالحة
es: Información de usuario OAuth inválida
fa: اطلاعات کاربر OAuth نامعتبر است

source: Invalid credentials
ar: بيانات الاعتماد غير صالحة
es: Credenciales inválidas
fa: اعتبارنامه نامعتبر است

source: Too many requests
ar: طلبات كثيرة جداً
es: Demasiadas solicitudes
fa: درخواست‌های بیش از حد

source: Rate limit exceeded
ar: تم تجاوز حد المعدل
es: Límite de velocidad excedido
fa: محدودیت نرخ تجاوز شده است

# metrics_endpoint_debug_only
source: Metrics endpoint is only available in debug mode
ar: نقطة نهاية المقاييس متاحة فقط في وضع التصحيح
es: El endpoint de métricas solo está disponible en modo debug
fa: نقطه پایانی متریک فقط در حالت اشکال‌زدایی در دسترس است

source: Successful Response
ar: استجابة ناجحة
es: Respuesta exitosa
fa: پاسخ موفق

# system_operational
source: System is operational
ar: النظام يعمل
es: El sistema está operativo
fa: سیستم در حال کار است

source: Invalid ID token
es: Token de ID inválido

source: Invalid ID token issuer
es: Emisor de token de ID inválido

source: Invalid refresh token
ar: رمز التحديث غير صالح
es: Token de actualización inválido
fa: توکن رفرش نامعتبر است

source: Session revoked or invalid
ar: الجلسة ملغاة أو غير صالحة
es: Sesión revocada o inválida
fa: نشست لغو شده یا نامعتبر است

source: Token revoked or blacklisted
ar: تم إبطال أو إدراج الرمز في القائمة السوداء
es: Token revocado o en lista negra
fa: توکن لغو شده یا در فهرست سیاه قرار دارد

source: User is invalid or inactive
ar: المستخدم غير صالح أو غير نشط
es: El usuario es inválido o está inactivo
fa: کاربر نامعتبر یا غیرفعال است

source: Invalid token
ar: رمز غير صالح
es: Token inválido
fa: توکن نامعتبر است

source: Session already revoked or invalid
ar: الجلسة ملغاة بالفعل أو غير صالحة
es: La sesión ya fue revocada o es inválida
fa: نشست قبلاً لغو شده یا نامعتبر است

# logout_failed_internal_error
source: Logout failed due to internal error
ar: فشل تسجيل الخروج بسبب خطأ داخلي
es: Error interno durante el cierre de sesión
fa: خروج به دلیل خطای داخلی ناموفق بود

# logout_successful
source: Logged out successfully
ar: تم تسجيل الخروج بنجاح
es: Sesión cerrada exitosamente
fa: خروج با موفقیت انجام شد

source: User not found
ar: المستخدم غير موجود
es: Usuario no encontrado
fa: کاربر یافت نشد

source: Invalid old password
ar: كلمة المرور القديمة غير صحيحة
es: Contraseña anterior inválida
fa: رمز عبور قدیمی نامعتبر است

# new_password_must_be_different
source: New password must be different from the old password
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن القديمة
es: La nueva contraseña debe ser diferente a la anterior
fa: رمز عبور جدید باید با رمز عبور قدیمی متفاوت باشد

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح
es: Contraseña cambiada exitosamente
fa: رمز عبور با موفقیت تغییر کرد

# password_change_failed
source: Password change failed due to an internal error
ar: فشل تغيير كلمة المرور بسبب خطأ داخلي
es: El cambio de contraseña falló debido a un error interno
fa: تغییر رمز عبور به دلیل خطای داخلی ناموفق بود

# password_change_service_unavailable
source: Password change service is temporarily unavailable
ar: خدمة تغيير كلمة المرور غير متاحة مؤقتاً
es: El servicio de cambio de contraseña no está disponible temporalmente
fa: سرویس تغییر رمز عبور موقتاً در دسترس نیست

# password_reset_email_subject
source: Password Reset Request - Cedrina
ar: طلب إعادة تعيين كلمة المرور - سيدرينا
es: Solicitud de Restablecimiento de Contraseña - Cedrina
fa: درخواست بازیابی رمز عبور - سدرینا

# password_reset_email_sent
source: If the email address is registered, you will receive a password reset link shortly
ar: إذا كان عنوان البريد الإلكتروني مسجلاً، فستتلقى رابط إعادة تعيين كلمة المرور قريباً
es: Si la dirección de correo está registrada, recibirás un enlace de restablecimiento de contraseña en breve
fa: اگر آدرس ایمیل ثبت شده باشد، لینک بازیابی رمز عبور به زودی دریافت خواهید کرد

# password_reset_email_failed
source: Failed to send password reset email
ar: فشل في إرسال بريد إعادة تعيين كلمة المرور
es: Error al enviar el correo de restablecimiento de contraseña
fa: ارسال ایمیل بازیابی رمز عبور با شکست مواجه شد

# password_reset_token_invalid
source: Password reset token is invalid or expired
ar: رمز إعادة تعيين كلمة المرور غير صالح أو منتهي الصلاحية
es: El token de restablecimiento de contraseña es inválido o ha expirado
fa: توکن بازیابی رمز عبور نامعتبر یا منقضی شده است

# password_reset_success
source: Password has been reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح
es: La contraseña ha sido restablecida exitosamente
fa: رمز عبور با موفقیت بازیابی شد

# password_reset_service_unavailable
source: Password reset service is temporarily unavailable
ar: خدمة إعادة تعيين كلمة المرور غير متاحة مؤقتاً
es: El servicio de restablecimiento de contraseña no está disponible temporalmente
fa: سرویس بازیابی رمز عبور موقتاً در دسترس نیست

# logout_service_unavailable
source: Logout service is temporarily unavailable
ar: خدمة تسجيل الخروج غير متاحة مؤقتاً
es: El servicio de cierre de sesión no está disponible temporalmente
fa: سرویس خروج موقتاً در دسترس نیست

# security_enhanced_logging_enabled
source: Enhanced security logging is enabled
ar: تم تفعيل التسجيل الأمني المحسن
es: El registro de seguridad mejorado está habilitado
fa: ثبت امنیتی پیشرفته فعال شده است

# security_event_logged
source: Security event has been logged
ar: تم تسجيل الحدث الأمني
es: El evento de seguridad ha sido registrado
fa: رویداد امنیتی ثبت شده است

source: Risk assessment completed
ar: تم إكمال تقييم المخاطر
es: La evaluación de riesgo ha sido completada
fa: ارزیابی ریسک تکمیل شده است

# threat_detection_triggered
source: Threat detection has been triggered
ar: تم تفعيل كشف التهديدات
es: La detección de amenazas ha sido activada
fa: تشخیص تهدید فعال شده است

# data_masking_applied
source: Data masking has been applied
ar: تم تطبيق إخفاء البيانات
es: El enmascaramiento de datos ha sido aplicado
fa: پنهان‌سازی داده‌ها اعمال شده است

# privacy_compliance_verified
source: Privacy compliance has been verified
ar: تم التحقق من الامتثال للخصوصية
es: El cumplimiento de privacidad ha sido verificado
fa: انطباق حریم خصوصی تأیید شده است

# siem_integration_active
source: SIEM integration is active
ar: تكامل SIEM نشط
es: La integración SIEM está activa
fa: ادغام SIEM فعال است

# audit_trail_generated
source: Audit trail has been generated
ar: تم إنشاء مسار التدقيق
es: La pista de auditoría ha sido generada
fa: ردیابی حسابرسی ایجاد شده است

# correlation_id_tracked
source: Correlation ID is being tracked
ar: يتم تتبع معرف الارتباط
es: El ID de correlación está siendo rastreado
fa: شناسه همبستگی در حال ردیابی است

# timing_attack_prevention_active
source: Timing attack prevention is active
ar: منع هجمات التوقيت نشط
es: La prevención de ataques de temporización está activa
fa: جلوگیری از حمله زمان‌بندی فعال است

# enumeration_attack_prevention_active
source: Enumeration attack prevention is active
ar: منع هجمات التعداد نشط
es: La prevención de ataques de enumeración está activa
fa: جلوگیری از حمله شمارش فعال است

# zero_trust_data_handling_active
source: Zero-trust data handling is active
ar: معالجة البيانات بثقة صفرية نشطة
es: El manejo de datos de confianza cero está activo
fa: مدیریت داده‌ها با اعتماد صفر فعال است

# security_context_captured
source: Security context has been captured
ar: تم التقاط السياق الأمني
es: El contexto de seguridad ha sido capturado
fa: زمینه امنیتی ثبت شده است

# enhanced_authentication_active
source: Enhanced authentication is active
ar: المصادقة المحسنة نشطة
es: La autenticación mejorada está activa
fa: احراز هویت پیشرفته فعال است

# enhanced_registration_active
source: Enhanced registration is active
ar: التسجيل المحسن نشط
es: El registro mejorado está activo
fa: ثبت‌نام پیشرفته فعال است

# enhanced_oauth_active
source: Enhanced OAuth authentication is active
ar: مصادقة OAuth المحسنة نشطة
es: La autenticación OAuth mejorada está activa
fa: احراز هویت OAuth پیشرفته فعال است

# enhanced_password_change_active
source: Enhanced password change is active
ar: تغيير كلمة المرور المحسن نشط
es: El cambio de contraseña mejorado está activo
fa: تغییر رمز عبور پیشرفته فعال است

# enhanced_password_reset_active
source: Enhanced password reset is active
ar: إعادة تعيين كلمة المرور المحسنة نشطة
es: El restablecimiento de contraseña mejorado está activo
fa: بازنشانی رمز عبور پیشرفته فعال است

# enhanced_logout_active
source: Enhanced logout is active
ar: تسجيل الخروج المحسن نشط
es: El cierre de sesión mejorado está activo
fa: خروج پیشرفته فعال است

source: Token cannot be empty
ar: لا يمكن أن يكون الرمز المميز فارغًا
es: El token no puede estar vacío
fa: توکن نمی‌تواند خالی باشد

# token_must_contain_uppercase
source: Token must contain at least one uppercase letter
ar: يجب أن يحتوي الرمز المميز على حرف كبير واحد على الأقل
es: El token debe contener al menos una letra mayúscula
fa: توکن باید حداقل یک حرف بزرگ داشته باشد

# token_must_contain_lowercase
source: Token must contain at least one lowercase letter
ar: يجب أن يحتوي الرمز المميز على حرف صغير واحد على الأقل
es: El token debe contener al menos una letra minúscula
fa: توکن باید حداقل یک حرف کوچک داشته باشد

# token_must_contain_digits
source: Token must contain at least one digit
ar: يجب أن يحتوي الرمز المميز على رقم واحد على الأقل
es: El token debe contener al menos un dígito
fa: توکن باید حداقل یک رقم داشته باشد

# token_must_contain_special_chars
source: Token must contain at least one special character
ar: يجب أن يحتوي الرمز المميز على حرف خاص واحد على الأقل
es: El token debe contener al menos un carácter especial
fa: توکن باید حداقل یک کاراکتر ویژه داشته باشد

# token_length_invalid
source: Token must be between {min_length} and {max_length} characters
ar: يجب أن يكون الرمز المميز بين {min_length} و {max_length} حرفًا
es: El token debe tener entre {min_length} y {max_length} caracteres
fa: توکن باید بین {min_length} تا {max_length} کاراکتر باشد

# token_expiry_cannot_be_empty
source: Token expiry timestamp cannot be empty
ar: لا يمكن أن تكون فترة انتهاء صلاحية الرمز المميز فارغة
es: La fecha de expiración del token no puede estar vacía
fa: زمان انقضای توکن نمی‌تواند خالی باشد

# token_expiry_must_be_timezone_aware
source: Token expiry timestamp must be timezone-aware
ar: يجب أن تكون فترة انتهاء صلاحية الرمز المميز مدركة للمنطقة الزمنية
es: La fecha de expiración del token debe incluir zona horaria
fa: زمان انقضای توکن باید از منطقه زمانی آگاه باشد

# email_confirmation_enabled
source: Email confirmation is enabled
es: La confirmación de email está habilitada
fa: تأیید ایمیل فعال است

# email_confirmation_disabled
source: Email confirmation is disabled
es: La confirmación de email está deshabilitada
fa: تأیید ایمیل غیرفعال است

# email_confirmation_subject
source: Confirm your email address
ar: قم بتأكيد حساب Cedrina الخاص بك
es: Confirma tu dirección de email
fa: آدرس ایمیل خود را تأیید کنید

# email_confirmation_send_failed
source: Failed to send email confirmation
es: Error al enviar la confirmación de email
fa: ارسال تأیید ایمیل ناموفق بود

# email_confirmation_email_failed
source: Failed to send confirmation email
es: Error al enviar el email de confirmación
fa: ارسال ایمیل تأیید ناموفق بود

# email_confirmation_token_invalid
source: Invalid or expired confirmation token
es: Token de confirmación inválido o expirado
fa: توکن تأیید نامعتبر یا منقضی شده است

source: Email confirmation token cannot be empty
es: El token de confirmación de email no puede estar vacío
fa: توکن تأیید ایمیل نمی‌تواند خالی باشد

# email_confirmation_token_must_be_string
source: Email confirmation token must be a string
es: El token de confirmación de email debe ser una cadena
fa: توکن تأیید ایمیل باید رشته باشد

# email_confirmation_token_length_invalid
source: Email confirmation token length is invalid
es: La longitud del token de confirmación de email es inválida
fa: طول توکن تأیید ایمیل نامعتبر است

# email_confirmation_token_format_invalid
source: Email confirmation token format is invalid
es: El formato del token de confirmación de email es inválido
fa: فرمت توکن تأیید ایمیل نامعتبر است

# email_confirmation_required
source: Email confirmation required. Please check your email and click the confirmation link.
ar: يرجى تأكيد بريدك الإلكتروني قبل تسجيل الدخول
es: Confirmación de email requerida. Por favor revisa tu email y haz clic en el enlace de confirmación.
fa: تأیید ایمیل الزامی است. لطفاً ایمیل خود را بررسی کرده و روی لینک تأیید کلیک کنید.

source: Email confirmation system error
es: Error del sistema de confirmación de email
fa: خطای سیستم تأیید ایمیل

# email_confirmation_resend_failed
source: Failed to resend email confirmation
es: Error al reenviar la confirmación de email
fa: ارسال مجدد تأیید ایمیل ناموفق بود

# email_confirmation_resent
source: Email confirmation has been resent
es: La confirmación de email ha sido reenviada
fa: تأیید ایمیل مجدداً ارسال شد

# email_confirmation_completed
source: Email confirmed successfully
es: Email confirmado exitosamente
fa: ایمیل با موفقیت تأیید شد

# email_confirmation_already_confirmed
source: Email is already confirmed
es: El email ya está confirmado
fa: ایمیل قبلاً تأیید شده است

# email_confirmation_user_not_found
source: User not found for email confirmation
es: Usuario no encontrado para la confirmación de email
fa: کاربر برای تأیید ایمیل یافت نشد

# email_confirmation_rate_limit_exceeded
source: Too many email confirmation requests. Please try again later.
es: Demasiadas solicitudes de confirmación de email. Por favor intenta de nuevo más tarde.
fa: درخواست‌های زیادی برای تأیید ایمیل. لطفاً بعداً دوباره تلاش کنید.

# error_prefix
source: Error: {message}
ar: خطأ: {message}
fa: خطا: {message}
